OpenFOAM/libAcoustics/libAcoustics-OF3.0.0/cases/tandem-65k-1/0/U.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (40 0 0);
    }
    
    outlet
    {
	type		zeroGradient;
	inletValue	uniform (0 0 0);
	value		uniform (0 0 0);
    }

    cyl-1
    {
        type		fixedValue;
        value		uniform (0 0 0);
    }
    
    cyl-2
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }

    free
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
