OpenFOAM/libAcoustics/libAcoustics-OF3.0.0/cases/tandem-65k-1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00325;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00325;
    }
    outlet
    {
        type            zeroGradient;
    }
    cyl-1
    {
        type            kqRWallFunction;
        value		uniform 0.00325;
    }
    cyl-2
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    free
    {
	type		zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
